app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks"
---
  def index
    @greeting = "HELLO, THERE!"
    @tasks = Task.all

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
  def show
    task_id = params[:id].to_i
    @task = Task.find_by(id: task_id)

INSERT INTO "tasks" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "A New task"], ["description", "something about a task"], ["created_at", "2019-10-07 01:46:31.101684"], ["updated_at", "2019-10-07 01:46:31.101684"]]
---
  def create
    @task = Task.new( task_params )

    @task.save

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
---
  def edit
    task_id = params[:id].to_i
    @edit_task = Task.find_by(id: task_id)

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "tasks" SET "name" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["name", "I'm a new task! I've been edited!"], ["updated_at", "2019-10-03 17:11:16.709940"], ["id", 6]]
UPDATE "tasks" SET "description" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["description", "updated descript"], ["updated_at", "2019-10-04 17:46:41.763503"], ["id", 1]]
---
  def update
    @task = Task.find_by(id: params[:id])
    if @task.nil?
      redirect_to root_path
      return
    end

    @task.update( task_params )

    if @task.update( task_params )

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 3]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 9]]
---
  def destroy
    @task = Task.find_by(id: params[:id])

    if @task.nil?
      redirect_to root_path
      return
    end

    @task.destroy

    if @task.destroy

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
UPDATE "tasks" SET "completion_date" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["completion_date", nil], ["updated_at", "2019-10-07 01:41:27.398570"], ["id", 16]]
---
  def complete

    @task = Task.find_by(id: params[:id])

    if @task.completion_date.nil?
      @task.completion_date = Date.today
    else
      @task.completion_date = nil
    end

    @task.save